Public Attributes | List of all members
API_IFCClassification Struct Reference
Element Manager API
IFC classification structure. More...
#include <APIdefs_Properties.h>
 Public Attributes
GS::Optional< GS::UniString >  | source
source of classification
GS::Optional< GS::UniString >  | edition
edition of classification
GS::Optional< GS::UniString >  | editionDate
the date on which the edition of the classification used became valid
GS::UniString  | name
name of classification
GS::Optional< GS::UniString >  | description
description of the classification
GS::Optional< GS::UniString >  | location
resource identifier or locator of the classification
Detailed Description
IFC classification structure.
Remarks
This structure contains the data of an IfcClassification.
Member Data Documentation
◆ description
 API_IFCClassification::description
description of the classification
◆ edition
 API_IFCClassification::edition
edition of classification
◆ editionDate
 API_IFCClassification::editionDate
the date on which the edition of the classification used became valid
◆ location
 API_IFCClassification::location
resource identifier or locator of the classification
◆ name
 API_IFCClassification::name
name of classification
◆ source
 API_IFCClassification::source
source of classification